

[DEBUG] Fitting initial NN.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_31 (Dense)             (None, 3)                 6         
_________________________________________________________________
dense_32 (Dense)             (None, 2)                 8         
=================================================================
Total params: 14
Trainable params: 14
Non-trainable params: 0
_________________________________________________________________
[DEBUG] Evaluating initial nn...
398/398 [==============================] - 0s 667us/step
[DEBUG] Keras-Scores obtained: loss:0.6523638601279139, acc:0.6231155775899264.
171/171 [==============================] - 0s 64us/step
[DEBUG] NN Evaluated Accuracy = 0.637426899887665.
Miscoding:  0.8805090571857206 Inaccuracy:  0.35964912280701755 Redundancy:  0.3553530751708428 Nescience:  0.610228098529191
[DEBUG] Adding new feature to cnn. 2 nº of features.
[DEBUG] Testing adding a new layer... Current hidden layers: [3, 3].
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_35 (Dense)             (None, 3)                 6         
_________________________________________________________________
dense_36 (Dense)             (None, 3)                 12        
_________________________________________________________________
dense_37 (Dense)             (None, 2)                 8         
=================================================================
Total params: 26
Trainable params: 26
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 2ms/step
[DEBUG] NN Evaluated Accuracy = 0.6608187127531621.
Added new layer - Nescience:  0.46680809247379407
[DEBUG] Testing adding a new unit... Hidden layers: [4, 3]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_38 (Dense)             (None, 4)                 8         
_________________________________________________________________
dense_39 (Dense)             (None, 3)                 15        
_________________________________________________________________
dense_40 (Dense)             (None, 2)                 8         
=================================================================
Total params: 31
Trainable params: 31
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 2ms/step
[DEBUG] NN Evaluated Accuracy = 0.637426899887665.
Added new unit - Nescience:  0.4937493165055135
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [4, 4]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_41 (Dense)             (None, 4)                 8         
_________________________________________________________________
dense_42 (Dense)             (None, 4)                 20        
_________________________________________________________________
dense_43 (Dense)             (None, 2)                 10        
=================================================================
Total params: 38
Trainable params: 38
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 2ms/step
[DEBUG] NN Evaluated Accuracy = 0.6900584809264244.
Added new unit - Nescience:  0.43663456029641934
[DEBUG] Nescience has been reduced after adding new unit
Tolerance: 0.045000000000000005
[DEBUG] Adding new feature to cnn. 2 nº of features.
DEBUG] Nescience reduced - SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_44 (Dense)             (None, 4)                 12        
_________________________________________________________________
dense_45 (Dense)             (None, 4)                 20        
_________________________________________________________________
dense_46 (Dense)             (None, 2)                 10        
=================================================================
Total params: 42
Trainable params: 42
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 2ms/step
[DEBUG] NN Evaluated Accuracy = 0.637426899887665.
Added new feature - Nescience:  0.47961035016419074
[DEBUG] Testing adding a new layer... Current hidden layers: [4, 4, 3].
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_47 (Dense)             (None, 4)                 12        
_________________________________________________________________
dense_48 (Dense)             (None, 4)                 20        
_________________________________________________________________
dense_49 (Dense)             (None, 3)                 15        
_________________________________________________________________
dense_50 (Dense)             (None, 2)                 8         
=================================================================
Total params: 55
Trainable params: 55
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 2ms/step
[DEBUG] NN Evaluated Accuracy = 0.8479532177685297.
Added new layer - Nescience:  0.36052111300504797
[DEBUG] Testing adding a new unit... Hidden layers: [5, 4, 3]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_51 (Dense)             (None, 5)                 15        
_________________________________________________________________
dense_52 (Dense)             (None, 4)                 24        
_________________________________________________________________
dense_53 (Dense)             (None, 3)                 15        
_________________________________________________________________
dense_54 (Dense)             (None, 2)                 8         
=================================================================
Total params: 62
Trainable params: 62
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 2ms/step
[DEBUG] NN Evaluated Accuracy = 0.9356725142713178.
Added new unit - Nescience:  0.2602869215589441
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [5, 5, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 4, 4]
Tolerance: 0.04050000000000001
[DEBUG] Adding new feature to cnn. 3 nº of features.
[DEBUG] Testing adding a new layer... Current hidden layers: [5, 4, 3, 3].
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_67 (Dense)             (None, 5)                 15        
_________________________________________________________________
dense_68 (Dense)             (None, 4)                 24        
_________________________________________________________________
dense_69 (Dense)             (None, 3)                 15        
_________________________________________________________________
dense_70 (Dense)             (None, 3)                 12        
_________________________________________________________________
dense_71 (Dense)             (None, 2)                 8         
=================================================================
Total params: 74
Trainable params: 74
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 3ms/step
[DEBUG] NN Evaluated Accuracy = 0.9239766078385693.
Added new layer - Nescience:  0.25593695368799163
[DEBUG] Testing adding a new unit... Hidden layers: [6, 4, 3, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 5, 3, 3]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_77 (Dense)             (None, 5)                 15        
_________________________________________________________________
dense_78 (Dense)             (None, 5)                 30        
_________________________________________________________________
dense_79 (Dense)             (None, 3)                 18        
_________________________________________________________________
dense_80 (Dense)             (None, 3)                 12        
_________________________________________________________________
dense_81 (Dense)             (None, 2)                 8         
=================================================================
Total params: 83
Trainable params: 83
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 3ms/step
[DEBUG] NN Evaluated Accuracy = 0.9415204674876921.
Added new unit - Nescience:  0.257067551537527
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [5, 5, 4, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 5, 3, 4]
Tolerance: 0.03645000000000001
[DEBUG] Adding new feature to cnn. 3 nº of features.
[DEBUG] Testing adding a new layer... Current hidden layers: [5, 5, 3, 3, 3].
[DEBUG] Testing adding a new unit... Hidden layers: [6, 5, 3, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 6, 3, 3]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_108 (Dense)            (None, 5)                 15        
_________________________________________________________________
dense_109 (Dense)            (None, 6)                 36        
_________________________________________________________________
dense_110 (Dense)            (None, 3)                 21        
_________________________________________________________________
dense_111 (Dense)            (None, 3)                 12        
_________________________________________________________________
dense_112 (Dense)            (None, 2)                 8         
=================================================================
Total params: 92
Trainable params: 92
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 4ms/step
[DEBUG] NN Evaluated Accuracy = 0.9415204674876921.
Added new unit - Nescience:  0.25619478279367514
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [5, 6, 4, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 6, 3, 4]
Tolerance: 0.03280500000000001
[DEBUG] Adding new feature to cnn. 3 nº of features.
[DEBUG] Testing adding a new layer... Current hidden layers: [5, 6, 3, 3, 3].
[DEBUG] Testing adding a new unit... Hidden layers: [6, 6, 3, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 7, 3, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 6, 4, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 6, 3, 4]
Tolerance: 0.02952450000000001
Final -> Miscoding:  0.7663498882723747 Inaccuracy:  0.11686390532544379 Redundancy:  0.5411280846063455 Nescience:  0.25619478279367514
def NN(X):
    W0 = [[ 0.89747673  0.30722845 -0.25696158  0.18922925 -0.2808168 ]
 [-0.0426857   0.55644625  0.8924093   0.33248368  0.6745578 ]]
    b0 = [-0.0084138  -0.00495517  0.         -0.00796014  0.        ]
    W1 = [[-0.1598832  -0.559639    0.26185143 -0.5778221   0.1244984  -0.728766  ]
 [-0.53078365  0.28030044  0.10250043  0.42661387 -0.7421528   0.64732456]
 [-0.4693096  -0.10309017  0.63058347  0.67967814  0.5155005   0.5950746 ]
 [-0.6108751  -0.25101095  0.14872296  0.38403314 -0.240394    0.3040488 ]
 [ 0.33677727  0.16744405  0.6219482   0.10862929  0.42205507  0.09654254]]
    b1 = [ 0.          0.         -0.04727485 -0.00289403 -0.00227711 -0.00129163]
    W2 = [[-3.1241792e-01  4.9609947e-01 -2.0387596e-01]
 [-7.5306815e-01 -2.8956783e-01  3.4140289e-02]
 [ 1.9462445e-01 -6.9805813e-01 -7.4327132e-04]
 [ 5.9192830e-01  7.7260274e-01 -2.6226261e-01]
 [ 4.6772903e-01  6.8435550e-02  6.7925692e-01]
 [ 5.9137738e-01 -1.3486091e-02  3.7753618e-01]]
    b2 = [-0.24481373 -0.00193642  0.00083269]
    W3 = [[-0.92072153  0.74002165  0.37548265]
 [ 0.7505007   0.92097473 -0.26758057]
 [ 0.8202975   0.92139256 -0.09311151]]
    b3 = [ 0.         -0.02033911 -0.64077413]
    W4 = [[ 0.42846406 -0.9073013 ]
 [-0.11578955 -0.19504091]
 [ 0.28462285 -0.73985004]]
    b4 = [-1.0321281  1.0321281]
    Z0 = np.matmul(W0, X) + b0
    A0 = np.relu(Z0)
    Z1 = np.matmul(W1, A0) + b1
    A1 = np.relu(Z1)
    Z2 = np.matmul(W2, A1) + b2
    A2 = np.relu(Z2)
    Z3 = np.matmul(W3, A2) + b3
    A3 = np.relu(Z3)
    Z4 = np.matmul(W4, A3) + b4
    A4 = np.relu(Z4)
    Z5 = np.matmul(W5, A4) + b5
    A5 = self.softmax(Z5)
    predictions = A5 > 0.5

    return predictions

_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_108 (Dense)            (None, 5)                 15        
_________________________________________________________________
dense_109 (Dense)            (None, 6)                 36        
_________________________________________________________________
dense_110 (Dense)            (None, 3)                 21        
_________________________________________________________________
dense_111 (Dense)            (None, 3)                 12        
_________________________________________________________________
dense_112 (Dense)            (None, 2)                 8         
=================================================================
Total params: 92
Trainable params: 92
Non-trainable params: 0
_________________________________________________________________
Total elapsed time for obtaining final network: 131.50759077072144 s.



