_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_1 (Dense)              (None, 3)                 6
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 8
=================================================================
Total params: 14
Trainable params: 14
Non-trainable params: 0
_________________________________________________________________
[DEBUG] Evaluating initial nn...
398/398 [==============================] - 0s 136us/step
[DEBUG] Keras-Scores obtained: loss:0.4381820664333938, acc:0.8743718592964824.
171/171 [==============================] - 0s 41us/step
[DEBUG] NN Evaluated Accuracy = 0.8830409370667753.
Miscoding:  0.8705571939465524 Inaccuracy:  0.1611328125 Redundancy:  0.3445945945945946 Nescience:  0.29249142352739504
[DEBUG] Adding new feature to cnn. 2 nº of features.
[DEBUG] Testing adding a new layer... Current hidden layers: [3, 3].
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_5 (Dense)              (None, 3)                 6
_________________________________________________________________
dense_6 (Dense)              (None, 3)                 12
_________________________________________________________________
dense_7 (Dense)              (None, 2)                 8
=================================================================
Total params: 26
Trainable params: 26
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 409us/step
[DEBUG] NN Evaluated Accuracy = 0.9064327499322724.
Added new layer - Nescience:  0.27599381439635967
[DEBUG] Testing adding a new unit... Hidden layers: [4, 3]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_8 (Dense)              (None, 4)                 8
_________________________________________________________________
dense_9 (Dense)              (None, 3)                 15
_________________________________________________________________
dense_10 (Dense)             (None, 2)                 8
=================================================================
Total params: 31
Trainable params: 31
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 524us/step
[DEBUG] NN Evaluated Accuracy = 0.9064327481894465.
Added new unit - Nescience:  0.27338093013860504
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [4, 4]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_11 (Dense)             (None, 4)                 8
_________________________________________________________________
dense_12 (Dense)             (None, 4)                 20
_________________________________________________________________
dense_13 (Dense)             (None, 2)                 10
=================================================================
Total params: 38
Trainable params: 38
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 596us/step
[DEBUG] NN Evaluated Accuracy = 0.9005847949730722.
Added new unit - Nescience:  0.2767096334716081
[DEBUG] Nescience has been reduced after adding new unit
Tolerance: 0.045000000000000005
[DEBUG] Adding new feature to cnn. 2 nº of features.
DEBUG] Nescience reduced - SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_14 (Dense)             (None, 4)                 12
_________________________________________________________________
dense_15 (Dense)             (None, 4)                 20
_________________________________________________________________
dense_16 (Dense)             (None, 2)                 10
=================================================================
Total params: 42
Trainable params: 42
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 721us/step
[DEBUG] NN Evaluated Accuracy = 0.941520469230518.
Added new feature - Nescience:  0.24872356209058183
[DEBUG] Testing adding a new layer... Current hidden layers: [4, 4, 3].
[DEBUG] Testing adding a new unit... Hidden layers: [5, 4]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_21 (Dense)             (None, 5)                 15
_________________________________________________________________
dense_22 (Dense)             (None, 4)                 24
_________________________________________________________________
dense_23 (Dense)             (None, 2)                 10
=================================================================
Total params: 49
Trainable params: 49
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 914us/step
[DEBUG] NN Evaluated Accuracy = 0.9532163756632666.
Added new unit - Nescience:  0.27199543565707457
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [5, 5]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_24 (Dense)             (None, 5)                 15
_________________________________________________________________
dense_25 (Dense)             (None, 5)                 30
_________________________________________________________________
dense_26 (Dense)             (None, 2)                 12
=================================================================
Total params: 57
Trainable params: 57
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 978us/step
[DEBUG] NN Evaluated Accuracy = 0.9473684224468922.
Added new unit - Nescience:  0.2505496638860092
[DEBUG] Nescience has been reduced after adding new unit
Tolerance: 0.04050000000000001
[DEBUG] Adding new feature to cnn. 3 nº of features.
DEBUG] Nescience reduced - SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_27 (Dense)             (None, 5)                 20
_________________________________________________________________
dense_28 (Dense)             (None, 5)                 30
_________________________________________________________________
dense_29 (Dense)             (None, 2)                 12
=================================================================
Total params: 62
Trainable params: 62
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 1ms/step
[DEBUG] NN Evaluated Accuracy = 0.9532163756632666.
Added new feature - Nescience:  0.2614567195248603
[DEBUG] Testing adding a new layer... Current hidden layers: [5, 5, 3].
[DEBUG] Testing adding a new unit... Hidden layers: [6, 5]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 6]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_37 (Dense)             (None, 5)                 20
_________________________________________________________________
dense_38 (Dense)             (None, 6)                 36
_________________________________________________________________
dense_39 (Dense)             (None, 2)                 14
=================================================================
Total params: 70
Trainable params: 70
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 1ms/step
[DEBUG] NN Evaluated Accuracy = 0.9532163756632666.
Added new unit - Nescience:  0.2535231457560099
[DEBUG] Nescience has been reduced after adding new unit
Tolerance: 0.03645000000000001
[DEBUG] Adding new feature to cnn. 4 nº of features.
[DEBUG] Testing adding a new layer... Current hidden layers: [5, 6, 3].
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_43 (Dense)             (None, 5)                 20
_________________________________________________________________
dense_44 (Dense)             (None, 6)                 36
_________________________________________________________________
dense_45 (Dense)             (None, 3)                 21
_________________________________________________________________
dense_46 (Dense)             (None, 2)                 8
=================================================================
Total params: 85
Trainable params: 85
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 2ms/step
[DEBUG] NN Evaluated Accuracy = 0.9356725160141437.
Added new layer - Nescience:  0.23925968467987785
[DEBUG] Testing adding a new unit... Hidden layers: [6, 6, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 7, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 6, 4]
Tolerance: 0.03280500000000001
[DEBUG] Adding new feature to cnn. 4 nº of features.
DEBUG] Nescience reduced - SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_59 (Dense)             (None, 5)                 25
_________________________________________________________________
dense_60 (Dense)             (None, 6)                 36
_________________________________________________________________
dense_61 (Dense)             (None, 3)                 21
_________________________________________________________________
dense_62 (Dense)             (None, 2)                 8
=================================================================
Total params: 90
Trainable params: 90
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 2ms/step
[DEBUG] NN Evaluated Accuracy = 0.9181286546221951.
Added new feature - Nescience:  0.2664629165201797
[DEBUG] Testing adding a new layer... Current hidden layers: [5, 6, 3, 3].
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_63 (Dense)             (None, 5)                 25
_________________________________________________________________
dense_64 (Dense)             (None, 6)                 36
_________________________________________________________________
dense_65 (Dense)             (None, 3)                 21
_________________________________________________________________
dense_66 (Dense)             (None, 3)                 12
_________________________________________________________________
dense_67 (Dense)             (None, 2)                 8
=================================================================
Total params: 102
Trainable params: 102
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 3ms/step
[DEBUG] NN Evaluated Accuracy = 0.9181286546221951.
Added new layer - Nescience:  0.2675083274564099
[DEBUG] Testing adding a new unit... Hidden layers: [6, 6, 3, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 7, 3, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 6, 4, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 6, 3, 4]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_83 (Dense)             (None, 5)                 25
_________________________________________________________________
dense_84 (Dense)             (None, 6)                 36
_________________________________________________________________
dense_85 (Dense)             (None, 3)                 21
_________________________________________________________________
dense_86 (Dense)             (None, 4)                 16
_________________________________________________________________
dense_87 (Dense)             (None, 2)                 10
=================================================================
Total params: 108
Trainable params: 108
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 0s 3ms/step
[DEBUG] NN Evaluated Accuracy = 0.941520469230518.
Added new unit - Nescience:  0.24580134180920946
[DEBUG] Nescience has been reduced after adding new unit
Tolerance: 0.02952450000000001
[DEBUG] Adding new feature to cnn. 5 nº of features.
[DEBUG] Testing adding a new layer... Current hidden layers: [5, 6, 3, 4, 3].
[DEBUG] Testing adding a new unit... Hidden layers: [6, 6, 3, 4]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 7, 3, 4]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_104 (Dense)            (None, 5)                 25
_________________________________________________________________
dense_105 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_106 (Dense)            (None, 3)                 24
_________________________________________________________________
dense_107 (Dense)            (None, 4)                 16
_________________________________________________________________
dense_108 (Dense)            (None, 2)                 10
=================================================================
Total params: 117
Trainable params: 117
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 3ms/step
[DEBUG] NN Evaluated Accuracy = 0.9181286546221951.
Added new unit - Nescience:  0.2624566110284812
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [5, 7, 4, 4]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_109 (Dense)            (None, 5)                 25
_________________________________________________________________
dense_110 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_111 (Dense)            (None, 4)                 32
_________________________________________________________________
dense_112 (Dense)            (None, 4)                 20
_________________________________________________________________
dense_113 (Dense)            (None, 2)                 10
=================================================================
Total params: 129
Trainable params: 129
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 4ms/step
[DEBUG] NN Evaluated Accuracy = 0.9239766078385693.
Added new unit - Nescience:  0.26358989556465556
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [5, 7, 4, 5]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_114 (Dense)            (None, 5)                 25
_________________________________________________________________
dense_115 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_116 (Dense)            (None, 4)                 32
_________________________________________________________________
dense_117 (Dense)            (None, 5)                 25
_________________________________________________________________
dense_118 (Dense)            (None, 2)                 12
=================================================================
Total params: 136
Trainable params: 136
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 4ms/step
[DEBUG] NN Evaluated Accuracy = 0.894736841756698.
Added new unit - Nescience:  0.2774850038624871
[DEBUG] Nescience has been reduced after adding new unit
Tolerance: 0.02657205000000001
[DEBUG] Adding new feature to cnn. 5 nº of features.
DEBUG] Nescience reduced - SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_119 (Dense)            (None, 5)                 30
_________________________________________________________________
dense_120 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_121 (Dense)            (None, 4)                 32
_________________________________________________________________
dense_122 (Dense)            (None, 5)                 25
_________________________________________________________________
dense_123 (Dense)            (None, 2)                 12
=================================================================
Total params: 141
Trainable params: 141
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 4ms/step
[DEBUG] NN Evaluated Accuracy = 0.9356725142713178.
Added new feature - Nescience:  0.24920404578339034
[DEBUG] Testing adding a new layer... Current hidden layers: [5, 7, 4, 5, 3].
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_124 (Dense)            (None, 5)                 30
_________________________________________________________________
dense_125 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_126 (Dense)            (None, 4)                 32
_________________________________________________________________
dense_127 (Dense)            (None, 5)                 25
_________________________________________________________________
dense_128 (Dense)            (None, 3)                 18
_________________________________________________________________
dense_129 (Dense)            (None, 2)                 8
=================================================================
Total params: 155
Trainable params: 155
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 4ms/step
[DEBUG] NN Evaluated Accuracy = 0.9356725160141437.
Added new layer - Nescience:  0.24712667271804986
[DEBUG] Testing adding a new unit... Hidden layers: [6, 7, 4, 5, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 8, 4, 5, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 7, 5, 5, 3]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_142 (Dense)            (None, 5)                 30
_________________________________________________________________
dense_143 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_144 (Dense)            (None, 5)                 40
_________________________________________________________________
dense_145 (Dense)            (None, 5)                 30
_________________________________________________________________
dense_146 (Dense)            (None, 3)                 18
_________________________________________________________________
dense_147 (Dense)            (None, 2)                 8
=================================================================
Total params: 168
Trainable params: 168
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 6ms/step
[DEBUG] NN Evaluated Accuracy = 0.9181286546221951.
Added new unit - Nescience:  0.25589932456425557
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [5, 7, 5, 6, 3]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_148 (Dense)            (None, 5)                 30
_________________________________________________________________
dense_149 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_150 (Dense)            (None, 5)                 40
_________________________________________________________________
dense_151 (Dense)            (None, 6)                 36
_________________________________________________________________
dense_152 (Dense)            (None, 3)                 21
_________________________________________________________________
dense_153 (Dense)            (None, 2)                 8
=================================================================
Total params: 177
Trainable params: 177
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 5ms/step
[DEBUG] NN Evaluated Accuracy = 0.9239766074900042.
Added new unit - Nescience:  0.25327214743042825
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [5, 7, 5, 6, 4]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_154 (Dense)            (None, 5)                 30
_________________________________________________________________
dense_155 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_156 (Dense)            (None, 5)                 40
_________________________________________________________________
dense_157 (Dense)            (None, 6)                 36
_________________________________________________________________
dense_158 (Dense)            (None, 4)                 28
_________________________________________________________________
dense_159 (Dense)            (None, 2)                 10
=================================================================
Total params: 186
Trainable params: 186
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 6ms/step
[DEBUG] NN Evaluated Accuracy = 0.9239766078385693.
Added new unit - Nescience:  0.25894663123767303
[DEBUG] Nescience has been reduced after adding new unit
Tolerance: 0.02391484500000001
[DEBUG] Adding new feature to cnn. 6 nº of features.
DEBUG] Nescience reduced - SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_160 (Dense)            (None, 5)                 35
_________________________________________________________________
dense_161 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_162 (Dense)            (None, 5)                 40
_________________________________________________________________
dense_163 (Dense)            (None, 6)                 36
_________________________________________________________________
dense_164 (Dense)            (None, 4)                 28
_________________________________________________________________
dense_165 (Dense)            (None, 2)                 10
=================================================================
Total params: 191
Trainable params: 191
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 5ms/step
[DEBUG] NN Evaluated Accuracy = 0.9415204674876921.
Added new feature - Nescience:  0.23000825480917333
[DEBUG] Testing adding a new layer... Current hidden layers: [5, 7, 5, 6, 4, 3].
[DEBUG] Testing adding a new unit... Hidden layers: [6, 7, 5, 6, 4]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 8, 5, 6, 4]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 7, 6, 6, 4]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 7, 5, 7, 4]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 7, 5, 6, 5]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_197 (Dense)            (None, 5)                 35
_________________________________________________________________
dense_198 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_199 (Dense)            (None, 5)                 40
_________________________________________________________________
dense_200 (Dense)            (None, 6)                 36
_________________________________________________________________
dense_201 (Dense)            (None, 5)                 35
_________________________________________________________________
dense_202 (Dense)            (None, 2)                 12
=================================================================
Total params: 200
Trainable params: 200
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 6ms/step
[DEBUG] NN Evaluated Accuracy = 0.9356725160141437.
Added new unit - Nescience:  0.23790557454660832
[DEBUG] Nescience has been reduced after adding new unit
Tolerance: 0.021523360500000012
[DEBUG] Adding new feature to cnn. 7 nº of features.
[DEBUG] Testing adding a new layer... Current hidden layers: [5, 7, 5, 6, 5, 3].
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_209 (Dense)            (None, 5)                 35
_________________________________________________________________
dense_210 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_211 (Dense)            (None, 5)                 40
_________________________________________________________________
dense_212 (Dense)            (None, 6)                 36
_________________________________________________________________
dense_213 (Dense)            (None, 5)                 35
_________________________________________________________________
dense_214 (Dense)            (None, 3)                 18
_________________________________________________________________
dense_215 (Dense)            (None, 2)                 8
=================================================================
Total params: 214
Trainable params: 214
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 7ms/step
[DEBUG] NN Evaluated Accuracy = 0.9298245627977695.
Added new layer - Nescience:  0.24761491032838479
[DEBUG] Testing adding a new unit... Hidden layers: [6, 7, 5, 6, 5, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 8, 5, 6, 5, 3]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_223 (Dense)            (None, 5)                 35
_________________________________________________________________
dense_224 (Dense)            (None, 8)                 48
_________________________________________________________________
dense_225 (Dense)            (None, 5)                 45
_________________________________________________________________
dense_226 (Dense)            (None, 6)                 36
_________________________________________________________________
dense_227 (Dense)            (None, 5)                 35
_________________________________________________________________
dense_228 (Dense)            (None, 3)                 18
_________________________________________________________________
dense_229 (Dense)            (None, 2)                 8
=================================================================
Total params: 225
Trainable params: 225
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 7ms/step
[DEBUG] NN Evaluated Accuracy = 0.9473684207040663.
Added new unit - Nescience:  0.23191762710135883
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [5, 8, 6, 6, 5, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 8, 5, 7, 5, 3]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_237 (Dense)            (None, 5)                 35
_________________________________________________________________
dense_238 (Dense)            (None, 8)                 48
_________________________________________________________________
dense_239 (Dense)            (None, 5)                 45
_________________________________________________________________
dense_240 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_241 (Dense)            (None, 5)                 40
_________________________________________________________________
dense_242 (Dense)            (None, 3)                 18
_________________________________________________________________
dense_243 (Dense)            (None, 2)                 8
=================================================================
Total params: 236
Trainable params: 236
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 7ms/step
[DEBUG] NN Evaluated Accuracy = 0.9181286542736299.
Added new unit - Nescience:  0.24283722195267562
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [5, 8, 5, 7, 6, 3]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_244 (Dense)            (None, 5)                 35
_________________________________________________________________
dense_245 (Dense)            (None, 8)                 48
_________________________________________________________________
dense_246 (Dense)            (None, 5)                 45
_________________________________________________________________
dense_247 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_248 (Dense)            (None, 6)                 48
_________________________________________________________________
dense_249 (Dense)            (None, 3)                 21
_________________________________________________________________
dense_250 (Dense)            (None, 2)                 8
=================================================================
Total params: 247
Trainable params: 247
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 7ms/step
[DEBUG] NN Evaluated Accuracy = 0.9005847949730722.
Added new unit - Nescience:  0.2433690731384865
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [5, 8, 5, 7, 6, 4]
Tolerance: 0.01937102445000001
[DEBUG] Adding new feature to cnn. 7 nº of features.
DEBUG] Nescience reduced - SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_258 (Dense)            (None, 5)                 40
_________________________________________________________________
dense_259 (Dense)            (None, 8)                 48
_________________________________________________________________
dense_260 (Dense)            (None, 5)                 45
_________________________________________________________________
dense_261 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_262 (Dense)            (None, 6)                 48
_________________________________________________________________
dense_263 (Dense)            (None, 3)                 21
_________________________________________________________________
dense_264 (Dense)            (None, 2)                 8
=================================================================
Total params: 252
Trainable params: 252
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 8ms/step
[DEBUG] NN Evaluated Accuracy = 0.918128656365021.
Added new feature - Nescience:  0.22755164958022114
[DEBUG] Testing adding a new layer... Current hidden layers: [5, 8, 5, 7, 6, 3, 3].
[DEBUG] Testing adding a new unit... Hidden layers: [6, 8, 5, 7, 6, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 9, 5, 7, 6, 3]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_280 (Dense)            (None, 5)                 40
_________________________________________________________________
dense_281 (Dense)            (None, 9)                 54
_________________________________________________________________
dense_282 (Dense)            (None, 5)                 50
_________________________________________________________________
dense_283 (Dense)            (None, 7)                 42
_________________________________________________________________
dense_284 (Dense)            (None, 6)                 48
_________________________________________________________________
dense_285 (Dense)            (None, 3)                 21
_________________________________________________________________
dense_286 (Dense)            (None, 2)                 8
=================================================================
Total params: 263
Trainable params: 263
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 8ms/step
[DEBUG] NN Evaluated Accuracy = 0.941520469230518.
Added new unit - Nescience:  0.2201364168963272
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [5, 9, 6, 7, 6, 3]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_287 (Dense)            (None, 5)                 40
_________________________________________________________________
dense_288 (Dense)            (None, 9)                 54
_________________________________________________________________
dense_289 (Dense)            (None, 6)                 60
_________________________________________________________________
dense_290 (Dense)            (None, 7)                 49
_________________________________________________________________
dense_291 (Dense)            (None, 6)                 48
_________________________________________________________________
dense_292 (Dense)            (None, 3)                 21
_________________________________________________________________
dense_293 (Dense)            (None, 2)                 8
=================================================================
Total params: 280
Trainable params: 280
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 1s 9ms/step
[DEBUG] NN Evaluated Accuracy = 0.9356725139227527.
Added new unit - Nescience:  0.19912685379617878
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [5, 9, 6, 8, 6, 3]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 9, 6, 7, 7, 3]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_301 (Dense)            (None, 5)                 40
_________________________________________________________________
dense_302 (Dense)            (None, 9)                 54
_________________________________________________________________
dense_303 (Dense)            (None, 6)                 60
_________________________________________________________________
dense_304 (Dense)            (None, 7)                 49
_________________________________________________________________
dense_305 (Dense)            (None, 7)                 56
_________________________________________________________________
dense_306 (Dense)            (None, 3)                 24
_________________________________________________________________
dense_307 (Dense)            (None, 2)                 8
=================================================================
Total params: 291
Trainable params: 291
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 2s 9ms/step
[DEBUG] NN Evaluated Accuracy = 0.9473684224468922.
Added new unit - Nescience:  0.20602704471394603
[DEBUG] Nescience has been reduced after adding new unit
[DEBUG] Testing adding a new unit... Hidden layers: [5, 9, 6, 7, 7, 4]
DEBUG] SAVED THIS CONFIGURATION.
_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_308 (Dense)            (None, 5)                 40
_________________________________________________________________
dense_309 (Dense)            (None, 9)                 54
_________________________________________________________________
dense_310 (Dense)            (None, 6)                 60
_________________________________________________________________
dense_311 (Dense)            (None, 7)                 49
_________________________________________________________________
dense_312 (Dense)            (None, 7)                 56
_________________________________________________________________
dense_313 (Dense)            (None, 4)                 32
_________________________________________________________________
dense_314 (Dense)            (None, 2)                 10
=================================================================
Total params: 301
Trainable params: 301
Non-trainable params: 0
_________________________________________________________________
171/171 [==============================] - 2s 9ms/step
[DEBUG] NN Evaluated Accuracy = 0.9356725142713178.
Added new unit - Nescience:  0.18745398009634673
[DEBUG] Nescience has been reduced after adding new unit
Tolerance: 0.01743392200500001
[DEBUG] Adding new feature to cnn. 8 nº of features.
[DEBUG] Testing adding a new layer... Current hidden layers: [5, 9, 6, 7, 7, 4, 3].
[DEBUG] Testing adding a new unit... Hidden layers: [6, 9, 6, 7, 7, 4]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 10, 6, 7, 7, 4]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 9, 7, 7, 7, 4]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 9, 6, 8, 7, 4]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 9, 6, 7, 8, 4]
[DEBUG] Testing adding a new unit... Hidden layers: [5, 9, 6, 7, 7, 5]
Tolerance: 0.015690529804500006
Final -> Miscoding:  0.2689056873836452 Inaccuracy:  0.0937227550130776 Redundancy:  0.6190476190476191 Nescience:  0.1874539
73
def NN(X):
    W0 = [[-0.6170396  -0.719492    0.13247192  0.25228226 -0.34244415]
 [ 0.49987978  1.9450848  -0.00446624  0.68853754  0.04324269]
 [ 0.19743979  0.7140189  -0.15387344 -0.01268232 -0.07126206]
 [-0.26401478 -0.05999574 -0.22008124 -0.37442955 -0.5969455 ]
 [ 0.12828034  0.51486117  0.57066363  0.2602573  -0.2783747 ]
 [-0.162758    0.05491978 -0.5886001  -0.27690175 -0.698145  ]
 [-0.47117513  0.9944671  -0.67225504 -0.09691346  0.5839409 ]]
    b0 = [ 0.         -0.26179445  0.          0.          0.        ]
    W1 = [[ 0.52723074  0.55086195 -0.48546872  0.12225151 -0.48038903 -0.50299543
   0.619923   -0.07072479 -0.4402625 ]
 [-0.33125246 -0.01384973 -0.49489853 -0.42586488  0.33289838 -0.5891832
  -0.62671566 -0.34282994 -0.1650708 ]
 [-0.4631434   0.22580463  0.57505846  0.6315888   0.43610322  0.3600484
   0.28799897 -0.3833979  -0.5770964 ]
 [-0.21316049  0.33125168 -0.14825553 -0.63312566 -0.4401492  -0.51896644
  -0.37445974 -0.30388838  0.42614532]
 [ 0.43244636  0.5114379   0.11816782 -0.15341824 -0.3728958  -0.05786395
   0.17107618 -0.15956017  0.603107  ]]
    b1 = [ 0.          0.23061812  0.          0.         -0.28096384  0.
  0.          0.          0.        ]
    W2 = [[ 0.3264531  -0.17964944 -0.48818558  0.5866968  -0.30688682 -0.5575284 ]
 [-0.32051948 -0.5075699   0.42741865 -0.5758811   0.567181   -0.38548824]
 [-0.21699026  0.08307564  0.54757994 -0.24125782 -0.42334187 -0.35236394]
 [ 0.0901686   0.25906342  0.4406318  -0.08488524  0.45382017 -0.18165839]
 [ 0.14616522  0.35729256  0.3907791  -0.23502448  0.5476797  -0.48717242]
 [-0.41744602 -0.0255844  -0.5703352   0.14783275  0.5781773  -0.585849  ]
 [-0.17308077 -0.23703405  0.52710384 -0.16775051 -0.23814523  0.40682405]
 [ 0.18435389  0.00076932 -0.24425068 -0.4770159   0.5090832   0.5934816 ]
 [ 0.1274007  -0.20170009  0.44751245 -0.03741473 -0.17519271 -0.21978635]]
    b2 = [-0.1231458  -0.29382008 -0.26004747  0.         -0.14411624  0.        ]
    W3 = [[-0.468495    0.26961124 -0.36041918  0.40469113 -0.22016996 -0.19380522
   0.5661856 ]
 [-0.00541997 -0.6079889  -0.147097    0.77327925  0.5149565  -0.5126921
   0.15277702]
 [-0.5869837  -0.36890727 -0.45365438  0.3757699  -0.17317206 -0.51172656
  -0.495024  ]
 [ 0.6574465   0.41666675  0.23218584  0.51306784  0.27172858  0.29470533
   0.6520053 ]
 [-0.0028368   0.10150853  0.40272376  0.12912413 -0.29860452 -0.16083634
  -0.5162529 ]
 [-0.11790538 -0.34514096 -0.42155248  0.22492826  0.04482085  0.05908972
  -0.12474489]]
    b3 = [-0.0262026  -0.02339191  0.29490468 -0.21355358  0.          0.
  0.        ]
    W4 = [[-0.07626319  0.35424995  0.362126   -0.53883654 -0.22480011  0.1960035
  -0.2853846 ]
 [-0.05287921  0.16852736 -0.36058846 -0.10830077 -0.42096284  0.01374114
  -0.18590379]
 [-0.40589184 -0.05567105 -0.20801947  0.7423544   0.12842102 -0.603674
  -0.6404487 ]
 [ 0.4313321   0.57254535 -0.2668315   0.6246005   0.48728752 -0.03728944
  -0.11567456]
 [ 0.35597527 -0.01041472 -0.38550484 -0.58481854 -0.18427056 -0.2194657
  -0.33386073]
 [ 0.05513674 -0.30235597 -0.6154981   0.53501725  0.6505927   0.1887123
   0.2146008 ]
 [-0.12674105 -0.05527866  0.10640663  0.4882176  -0.00984222 -0.240383
   0.40236926]]
    b4 = [-0.29637018 -0.39824748  0.          0.47418886 -0.38120377  0.
  0.        ]
    W5 = [[ 0.26957262  0.81205606  0.80890274  0.56887394]
 [-0.42058504 -0.09290495  0.6511518  -0.2238791 ]
 [ 0.44642872  0.32677907  0.00949955  0.6243941 ]
 [ 1.0017611   0.1860042  -0.5759668  -0.08190888]
 [-0.23184496  0.4345023   0.6702303  -0.56516874]
 [-0.11486119 -0.13434911 -0.67274904  0.12202275]
 [-0.5622588  -0.1908558   0.4719743   0.09351373]]
    b5 = [ 0.6971047  -0.57718563 -0.30630213  0.        ]
    W6 = [[-1.0193442   0.2921    ]
 [-0.316577   -0.6348012 ]
 [ 1.1273961  -1.0467457 ]
 [ 0.6860423   0.75289106]]
    b6 = [-0.49771178  0.49771175]
    Z0 = np.matmul(W0, X) + b0
    A0 = np.relu(Z0)
    Z1 = np.matmul(W1, A0) + b1
    A1 = np.relu(Z1)
    Z2 = np.matmul(W2, A1) + b2
    A2 = np.relu(Z2)
    Z3 = np.matmul(W3, A2) + b3
    A3 = np.relu(Z3)
    Z4 = np.matmul(W4, A3) + b4
    A4 = np.relu(Z4)
    Z5 = np.matmul(W5, A4) + b5
    A5 = np.relu(Z5)
    Z6 = np.matmul(W6, A5) + b6
    A6 = np.relu(Z6)
    Z7 = np.matmul(W7, A6) + b7
    A7 = self.softmax(Z7)
    predictions = A7 > 0.5

    return predictions

_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
dense_308 (Dense)            (None, 5)                 40
_________________________________________________________________
dense_309 (Dense)            (None, 9)                 54
_________________________________________________________________
dense_310 (Dense)            (None, 6)                 60
_________________________________________________________________
dense_311 (Dense)            (None, 7)                 49
_________________________________________________________________
dense_312 (Dense)            (None, 7)                 56
_________________________________________________________________
dense_313 (Dense)            (None, 4)                 32
_________________________________________________________________
dense_314 (Dense)            (None, 2)                 10
=================================================================
Total params: 301
Trainable params: 301
Non-trainable params: 0
_________________________________________________________________
Total elapsed time for obtaining final network: 890.4930815696716 s.
